app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC
---
  def index
    @blog = Blog.all

INSERT INTO "blogs" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "tweet1"], ["created_at", "2020-08-31 10:05:49.264403"], ["updated_at", "2020-08-31 10:05:49.264403"]]
---
  def create
    @blog = Blog.new(blog_params)
    if params[:back]
      render :new
    else
      if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["content", "I think my twitter is good"], ["updated_at", "2020-08-31 04:23:36.713433"], ["id", 4]]
---
  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)